run/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application rhoSimpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 400;

deltaT 1;

writeControl timeStep;

writeInterval 100;

purgeWrite 0;

writeFormat binary;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
adjustTimeStep yes;
maxCo 2;

functions
{
#includeFunc Q
#include "surfaces"
#include "forces"
#include "AMIWeights"
#includeFunc MachNo
#includeFunc solverInfo
  yPlus
  {
    type yPlus;
    libs
      (
        fieldFunctionObjects
      );
    executeControl timeStep;
    writeControl writeTime;
    patches
      (
        propellerTip
      );
  }
  wallShearStress1
  {
    type wallShearStress;
    libs
      (
        "libfieldFunctionObjects.so"
      );
    patches
      (
        propellerTip
      );
    executeControl timeStep;
    writeControl writeTime;
  }
} 	// ************************************************************************* //

